/*
 Navicat MySQL Data Transfer

 Source Server         : 123
 Source Server Type    : MySQL
 Source Server Version : 50726
 Source Host           : localhost:3306
 Source Schema         : mysql

 Target Server Type    : MySQL
 Target Server Version : 50726
 File Encoding         : 65001

 Date: 20/03/2022 14:26:02
*/

DROP DATABASE IF EXISTS dict;
CREATE DATABASE dict;
USE dict;
SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for zi
-- ----------------------------
DROP TABLE IF EXISTS `zi`;
CREATE TABLE `zi`  (
  `ID` INT AUTO_INCREMENT,
  `zi` VARCHAR(255) CHARACTER SET GB18030 COLLATE gb18030_chinese_ci NULL DEFAULT NULL,
  `weizhi` VARCHAR(255) CHARACTER SET GB18030 COLLATE gb18030_chinese_ci NULL DEFAULT NULL,
  `shuowen` TEXT CHARACTER SET GB18030 COLLATE gb18030_chinese_ci NULL,
  `yin` VARCHAR(255) CHARACTER SET GB18030 COLLATE gb18030_chinese_ci NULL DEFAULT NULL,
  `yi` TEXT CHARACTER SET GB18030 COLLATE gb18030_chinese_ci NULL,
  `wending` TEXT CHARACTER SET GB18030 COLLATE gb18030_chinese_ci NULL,
  `yinding` TEXT CHARACTER SET GB18030 COLLATE gb18030_chinese_ci NULL,
  `yiding` TEXT CHARACTER SET GB18030 COLLATE gb18030_chinese_ci NULL,
  `zixing` BLOB NULL,
  PRIMARY KEY (`ID`) USING BTREE 
) ENGINE = INNODB CHARACTER SET GB18030 COLLATE = gb18030_chinese_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of zixing (test use)
-- ----------------------------
DROP TABLE IF EXISTS `zixing`;
CREATE TABLE `zixing` (
   `ID` INT NULL,
   `miaoshu` VARCHAR(255) CHARACTER SET GB18030 COLLATE gb18030_chinese_ci NULL,
   zixing BLOB NULL
) ENGINE = INNODB CHARACTER SET GB18030 COLLATE = gb18030_chinese_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of xing
-- ----------------------------
DROP TABLE IF EXISTS `xing`;
CREATE TABLE xing (
   `ID` INT NOT NULL,
   `url` VARCHAR(50) NOT NULL,
   `miaoshu` VARCHAR(255)
) ENGINE = INNODB CHARACTER SET GB18030 COLLATE = gb18030_chinese_ci ROW_FORMAT = DYNAMIC;


-- ----------------------------
-- Records of admin
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
   id CHAR(13),
   `name` VARCHAR(30) NOT NULL,
   `email` VARCHAR(30) NOT NULL,
   `password` VARCHAR(20) NOT NULL,
   PRIMARY KEY (`id`) USING BTREE
) ENGINE = INNODB ROW_FORMAT = DYNAMIC;

SET FOREIGN_KEY_CHECKS = 1;

INSERT INTO `zi` (`zi`, `weizhi`, `shuowen`, `yin`, `yi`, `wending`, `yinding`, `yiding`, `zixing`) 
VALUES ('諾', '《漢語大字典》（第二版）4244頁 言部 8畫', '《説文》：“諾，𧭭也。从言，若聲。”段玉裁注:“    者，應之俗字。”刘心源《奇觚室吉金文述》:“若即諾之古文。既从口又从言，於義為贅,知諾為後出字也。”', 'nuò  《廣韻》奴各切，入鐸泥。鐸部。', '1. 答应声。《説文·言部》 ：“諾，   也。”《論語·陽貨》：\r\n“諾，吾將仕矣。”《戰國策·齊策四》：”孟嘗君不説，曰: ‘諾，先生休矣。’”《禮記·曲禮上》：“父召無諾，先生召無諾，唯而起。”孔穎達疏:“父與先生呼召稱唯。唯，   也。不得稱諾，其稱諾，則似寬緩驕慢。但今人稱諾，猶古之稱唯，則其意急也。今之稱咏，猶古之稱諾，其意緩也，是今古異也。”\r\n2. 答应;允许。《老子》第六十三章:“夫輕諾必寡信，多易必多難。”《荀子·王霸》：“刑賞已諾，信乎天下矣。”楊倞注:“諾，許也。”《史記，季布欒布列傳》：“楚人諺曰：得黄金百（斤），不如得季布一諾。’”\r\n3. 顺从。《吕氏春秋·知士》：“劑貌辨答曰：\'敬諾。\'”高誘注：“諾，順。”\r\n4. 古时批字于公文之尾，表示许可叫“诺”，犹今签字。《後漢書·黨鋼傳序》：“汝南太守范孟博，南陽宗資主畫諾。”《三國志·吴志·黄蓋傳》：“一以文書委付兩掾兩掾所署，事入諾出。”《南史·齊江夏王鋒傳》：“（鋒）五歲，高帝使學鳳尾諾。”漬黄遵憲《述聞》：“是誰畫諾誰傳詔，一紙明贻萬國羞！”\r\n5. 方言。深。唐樊綽《蠻書》卷八：“言語音，白蠻最正，蒙舍蠻次之，諸部落不如也，但名物或與漢不同，及四聲訛重，大事多不與面言，必使人往來達其詞意，以此取定，謂之行諾。…閣，高也。諾，深也。”\r\n6. 姓。《萬姓統譜·藥韻》：“諾，見《姓苑》。\r\n', NULL, NULL, '1.用戶朱城（2011年）根據字義第3條作出修訂：在古代，“诺”作为应答之词，一般用于上对下、长对幼、尊对卑，并不表示恭敬：若析而言之，“诺”还不如“唯”那样恭敬有礼。例如，《礼记·玉藻》：“父命呼，唯而不诺。”《礼记·曲礼上》：“父召无诺，先生召无诺，唯而起。”“诺”与表敬副词“敬”组合后，才有了表示恭谨、礼貌的含义，且不受身份地位的限制。“敬诺”一语上古习见。例如，《吕氏春秋·直谏》：“王曰：‘敬诺。’引席王伏。”《战国策·赵策》：“太后曰：\'敬诺，年几何矣？\'” 《史记·扁鹊仓公列传》：“（长桑君）乃呼扁鹊私坐，间与语曰：\'我有禁方，年老，欲传与人，公毋泄。’扁鹊曰：‘敬诺。’”在《吕氏春秋·知士》例中，高诱注文为“顺”，是对“敬诺”这一应答方式在句中特定含义的说明，言剂貌辨恭顺地对齐宣王的要求作出表示同意的回应，旨在提示附加在“诺\"字上所特有的交际功能，而并不是对句中“诺”的词义作出的解释。此项仅此1例，应并入“答应；允许”义项中，不能把高注作为设置义项的依据。\r\n1.用戶朱城（2011年）根據字義第3條作出修訂：在古代，“诺”作为应答之词，一般用于上对下、长对幼、尊对卑，并不表示恭敬：若析而言之，“诺”还不如“唯”那样恭敬有礼。例如，《礼记·玉藻》：“父命呼，唯而不诺。”《礼记·曲礼上》：“父召无诺，先生召无诺，唯而起。”“诺”与表敬副词“敬”组合后，才有了表示恭谨、礼貌的含义，且不受身份地位的限制。“敬诺”一语上古习见。例如，《吕氏春秋·直谏》：“王曰：‘敬诺。’引席王伏。”《战国策·赵策》：“太后曰：\'敬诺，年几何矣？\'” 《史记·扁鹊仓公列传》：“（长桑君）乃呼扁鹊私坐，间与语曰：\'我有禁方，年老，欲传与人，公毋泄。’扁鹊曰：‘敬诺。’”在《吕氏春秋·知士》例中，高诱注文为“顺”，是对“敬诺”这一应答方式在句中特定含义的说明，言剂貌辨恭顺地对齐宣王的要求作出表示同意的回应，旨在提示附加在“诺\"字上所特有的交际功能，而并不是对句中“诺”的词义作出的解释。此项仅此1例，应并入“答应；允许”义项中，不能把高注作为设置义项的依据。\r\n1.用戶朱城（2011年）根據字義第3條作出修訂：在古代，“诺”作为应答之词，一般用于上对下、长对幼、尊对卑，并不表示恭敬：若析而言之，“诺”还不如“唯”那样恭敬有礼。例如，《礼记·玉藻》：“父命呼，唯而不诺。”《礼记·曲礼上》：“父召无诺，先生召无诺，唯而起。”“诺”与表敬副词“敬”组合后，才有了表示恭谨、礼貌的含义，且不受身份地位的限制。“敬诺”一语上古习见。例如，《吕氏春秋·直谏》：“王曰：‘敬诺。’引席王伏。”《战国策·赵策》：“太后曰：\'敬诺，年几何矣？\'” 《史记·扁鹊仓公列传》：“（长桑君）乃呼扁鹊私坐，间与语曰：\'我有禁方，年老，欲传与人，公毋泄。’扁鹊曰：‘敬诺。’”在《吕氏春秋·知士》例中，高诱注文为“顺”，是对“敬诺”这一应答方式在句中特定含义的说明，言剂貌辨恭顺地对齐宣王的要求作出表示同意的回应，旨在提示附加在“诺\"字上所特有的交际功能，而并不是对句中“诺”的词义作出的解释。此项仅此1例，应并入“答应；允许”义项中，不能把高注作为设置义项的依据。\r\n', NULL);
INSERT INTO `zi` (`zi`, `weizhi`, `shuowen`, `yin`, `yi`, `wending`, `yinding`, `yiding`, `zixing`)
VALUES ('畑', '《漢語大字典》（第二版）2352頁 火部 5畫', '', 'tián', '旱地。《龙树五明论》卷上：“第十八兄弟不恭顺，分畑割宅，无义异居，或和合共分，或一人欲为头分者。”', NULL, NULL, '1.用戶劉曄（2020）對字義作出修訂。（一）“畑”是“畈”字的变形俗字。《本生经》中有“田畑”连用数例。（1）《本生经》卷四《不喜本生谭》：彼后入俗为俗人， 建立生计， 日思衣服装饰、男佣女佣、田畑野牛、子息子女等事。（《汉译南传大藏经》第３３册， 第９７页）（2）同卷《狮子皮本生谭》：有一商人以驴马运载商品贩卖，所到之处， 彼由驴背卸下商品，以獅子毛皮缠敷驴身， 放入米麦田畑之中。田畑守护之人见为獅子，不敢接近。某日商人于村中人家住宿，准备朝食之间，又将乘驴缠敷狮皮，放入田中。畑中守护之人，见为獅子不敢接近，逐家报告，村民皆携武器，吹法螺贝，鸣击大鼓，行近田畑，声叫喝，驴心恐怖，发声长鸣。…… 尔时商人赶至，见驴已将灭，乃作第二之偈：“久置田畑中， 妒得食麦缘， 缠敷獅毛皮， 驴鸣致死灭。”（同上， 第１０７页）若“畑” 释为“ 旱田”， 那么“田畑”为何要连用？ 连用又是何义呢？ 显然释“畑”为旱田， 于义未安。我们认为上揭诸例的“田畑”应是“田畈”，“畑”即“畈”字。《广韵·願韻》：“畈， 田畈。”《正字通·田部》：“畈， 方绀切，音贩，田畈，平畴也。”《大字典》释“畈”为“成片的田”，故“田畈”即田地。《本生经》中还有“畑”字单用之例， 释为“旱田”义也不通， 而释作“畈”则文从字顺。总之，《大字典》释“畑”为“旱地”义，不可取。（二）“畑”是“烟”的俗字。《考正》所引第二例为：“如说彼厨等中定有火，以现畑故，如山等处，于雾等性，既怀犹预，皆火有不决。”据文意，是说厨房中一定有火，出现了烟尘，“畑”即“烟”，无由释为“ 旱地 ”。又见钱谦益《大佛顶首楞严经疏解蒙钞卷》 第三卷 ：（引证）（百法释云）言六色者，言所取故。有二十五种，谓青黄赤白，此四为实。析至极微，色不改故。长短方圆，粗细高低，此相状假。至极微无相状故。正不正，光影明暗，畑尘云雾，迫色表色，空一显色，此分位假。（《卍新续藏 》第１３册）据“光影明暗”可知“畑尘云雾”即“ 烟尘云雾”，“畑”即“烟”，与 旱地义无涉 。（三）“畑”是“油”的讹字。《樵隐和尚语录》卷下之《送灯藏主》：誓当捏虚空为一灯盏，沥九江为一灯畑。捻五老峰为一灯炷，使少林龙渾雪峤，三灯洞燜无尽。（《卍新续藏》第７０册 ）若“畑 ”为“烟”则“灯烟”不成词，而“灯畑”之“畑”显亦与旱地义无涉。句中校记云：“畑疑油”。我们认为此说可从。', NULL);

INSERT INTO `admin`(`id`, `name`, `email`, `password`)
VALUES('2020202020202', '百特曼', 'joker@batman.com', '123456');